jonacappelle/nRF52-BLE-IMU/IMU/imu.c
				// New IMU data is available: count how many bytes are available
				bytes_available++;
					
				#ifdef USE_NUS
				// Put data in the ringbuffer
				config_data[0] = ENABLE_GYRO;
				len_in = sizeof(config_data);

				uint32_t buffer_gyro_len = sizeof(config_data) + sizeof(event->data.gyr.vect);
				uint8_t buffer_gyro[buffer_gyro_len];

				// Copy data into buffer
				memcpy(buffer_gyro, config_data, sizeof(config_data));
				memcpy(&buffer_gyro[1], (event->data.gyr.vect), sizeof(event->data.gyr.vect));

				// Put the data in FIFO buffer: APP_FIFO instead of ringbuff library
            	err_code = app_fifo_write(&imu_fifo, buffer_gyro, &buffer_gyro_len);
				if (err_code == NRF_ERROR_NO_MEM)
            	{
                	NRF_LOG_INFO("IMU FIFO BUFFER FULL!");
            	}
				if (err_code == NRF_SUCCESS)
				{
					NRF_LOG_INFO("OK");
				}
				#endif

				ble_tms_raw_t data;

				data.accel.x =      (int16_t)((event->data.acc.vect[0]) * (1 << RAW_Q_FORMAT_ACC_COMMA_BITS));
				data.accel.y =      (int16_t)((event->data.acc.vect[1]) * (1 << RAW_Q_FORMAT_ACC_COMMA_BITS));
				data.accel.z =      (int16_t)((event->data.acc.vect[2]) * (1 << RAW_Q_FORMAT_ACC_COMMA_BITS));

				data.gyro.x =       (int16_t)((event->data.gyr.vect[0]) * (1 << RAW_Q_FORMAT_GYR_COMMA_BITS));
				data.gyro.y =       (int16_t)((event->data.gyr.vect[1]) * (1 << RAW_Q_FORMAT_GYR_COMMA_BITS));
				data.gyro.z =       (int16_t)((event->data.gyr.vect[2]) * (1 << RAW_Q_FORMAT_GYR_COMMA_BITS));

				data.compass.y =   -(int16_t)((event->data.mag.vect[0]) * (1 << RAW_Q_FORMAT_CMP_COMMA_BITS)); // Changed axes and inverted. Corrected for rotation of axes.
				data.compass.x =    (int16_t)((event->data.mag.vect[1]) * (1 << RAW_Q_FORMAT_CMP_COMMA_BITS)); // Changed axes. Corrected for rotation of axes.
				data.compass.z =    (int16_t)((event->data.mag.vect[2]) * (1 << RAW_Q_FORMAT_CMP_COMMA_BITS));


				(void)ble_tms_raw_set(&m_tms, &data);				

			break;
		}
		case INV_SENSOR_TYPE_MAGNETOMETER:
		{
			NRF_LOG_INFO("data event %s (nT): %d %d %d %d", inv_sensor_str(event->sensor),
					(int)(event->data.mag.vect[0]*1000),
					(int)(event->data.mag.vect[1]*1000),
					(int)(event->data.mag.vect[2]*1000),
					(int)(event->data.mag.accuracy_flag));
					
				// New IMU data is available: count how many bytes are available
				bytes_available++;
					
				#ifdef USE_NUS
				// Put data in the ringbuffer
				config_data[0] = ENABLE_MAG;
				len_in = sizeof(config_data);

				uint32_t buffer_mag_len = sizeof(config_data) + sizeof(event->data.mag.vect);
				uint8_t buffer_mag[buffer_mag_len];

				// Copy data into buffer
				memcpy(buffer_mag, config_data, sizeof(config_data));
				memcpy(&buffer_mag[1], (event->data.mag.vect), sizeof(event->data.mag.vect));

				// Put the data in FIFO buffer: APP_FIFO instead of ringbuff library
            	err_code = app_fifo_write(&imu_fifo, buffer_mag, &buffer_mag_len);
				if (err_code == NRF_ERROR_NO_MEM)
            	{
                	NRF_LOG_INFO("IMU FIFO BUFFER FULL!");
            	}
				if (err_code == NRF_SUCCESS)
				{
					NRF_LOG_INFO("OK");
				}
				#endif
					
			break;
		}
		case INV_SENSOR_TYPE_UNCAL_GYROSCOPE:
		{
			INV_MSG(INV_MSG_LEVEL_INFO, "data event %s (mdps): %d %d %d %d %d %d", inv_sensor_str(event->sensor),
					(int)(event->data.gyr.vect[0]*1000),
					(int)(event->data.gyr.vect[1]*1000),
					(int)(event->data.gyr.vect[2]*1000),
					(int)(event->data.gyr.bias[0]*1000),
					(int)(event->data.gyr.bias[1]*1000),
					(int)(event->data.gyr.bias[2]*1000));
			break;
		}
		case INV_SENSOR_TYPE_UNCAL_MAGNETOMETER:
		{
			INV_MSG(INV_MSG_LEVEL_INFO, "data event %s (nT): %d %d %d %d %d %d", inv_sensor_str(event->sensor),
					(int)(event->data.mag.vect[0]*1000),
					(int)(event->data.mag.vect[1]*1000),
					(int)(event->data.mag.vect[2]*1000),
					(int)(event->data.mag.bias[0]*1000),
					(int)(event->data.mag.bias[1]*1000),
					(int)(event->data.mag.bias[2]*1000));
			break;
		}
		case INV_SENSOR_TYPE_GAME_ROTATION_VECTOR:
		case INV_SENSOR_TYPE_ROTATION_VECTOR:
		case INV_SENSOR_TYPE_GEOMAG_ROTATION_VECTOR:
		{
				// New IMU data is available: count how many bytes are available
				bytes_available++;
//			NRF_LOG_INFO("Bytes: %d", bytes_available);
			
			NRF_LOG_INFO("%s:	%d %d %d %d", inv_sensor_str(event->sensor),
					(int)(event->data.quaternion.quat[0]*1000),
					(int)(event->data.quaternion.quat[1]*1000),
					(int)(event->data.quaternion.quat[2]*1000),
					(int)(event->data.quaternion.quat[3]*1000));
//					(int)(event->data.gyr.accuracy_flag),
//					(int)(event->data.acc.accuracy_flag),	
//					(int)(event->data.mag.accuracy_flag), // 0 - 3: not calibrated - fully calibrated
//					(int)(event->data.quaternion.accuracy_flag));
				



				#ifdef USE_NUS
				// Put data in the ringbuffer
				config_data[0] = ENABLE_QUAT6;
				len_in = sizeof(config_data);

				uint32_t buffer_len = sizeof(config_data) + sizeof(event->data.quaternion.quat);
				uint8_t buffer[buffer_len];

				// Copy data into buffer
				memcpy(buffer, config_data, sizeof(config_data));
				memcpy(&buffer[1], (event->data.quaternion.quat), sizeof(event->data.quaternion.quat));
				

				// // err_code = nrf_ringbuf_cpy_put(&m_ringbuf, config_data, &len_in);
				// // len_in = sizeof(event->data.quaternion.quat);	
				// err_code = nrf_ringbuf_cpy_put(&m_ringbuf, buffer, &buffer_len); //(uint8_t *)(event->data.quaternion.quat)
				// APP_ERROR_CHECK(err_code);

				
				// Put the data in FIFO buffer: APP_FIFO instead of ringbuff library
            	err_code = app_fifo_write(&imu_fifo, buffer, &buffer_len);
				if (err_code == NRF_ERROR_NO_MEM)
            	{
                	NRF_LOG_INFO("IMU FIFO BUFFER FULL!");
            	}
				if (err_code == NRF_SUCCESS)
				{
					NRF_LOG_INFO("OK");
				}
				#endif

				ble_tms_quat_t data;

				float quat[4];
				memcpy(quat, (event->data.quaternion.quat), sizeof(event->data.quaternion.quat));

				fixed_point_t p_quat[4];
				p_quat[0] = float_to_fixed_quat(quat[0]);
				p_quat[1] = float_to_fixed_quat(quat[1]);
				p_quat[2] = float_to_fixed_quat(quat[2]);
				p_quat[3] = float_to_fixed_quat(quat[3]);

				data.w = p_quat[0];
				data.x = p_quat[1];
				data.y = p_quat[2];
				data.z = p_quat[3];

